grevaillot/svd_tools/headers/STM32F469/rcc.h
/** @defgroup rcc_apb2lpenr APB2LPENR APB2 peripheral clock enabled in low power mode register
@{*/

/** RCC_APB2LPENR_DSILPEN DSI clocks enable during Sleep mode **/
#define RCC_APB2LPENR_DSILPEN		(1 << 27)
/** RCC_APB2LPENR_LTDCLPEN LTDC clock enable **/
#define RCC_APB2LPENR_LTDCLPEN		(1 << 26)
/** RCC_APB2LPENR_SAI1LPEN SAI1 clock enable **/
#define RCC_APB2LPENR_SAI1LPEN		(1 << 22)
/** RCC_APB2LPENR_SPI6LPEN SPI 6 clock enable during Sleep mode **/
#define RCC_APB2LPENR_SPI6LPEN		(1 << 21)
/** RCC_APB2LPENR_SPI5LPEN SPI 5 clock enable during Sleep mode **/
#define RCC_APB2LPENR_SPI5LPEN		(1 << 20)
/** RCC_APB2LPENR_TIM11LPEN TIM11 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM11LPEN		(1 << 18)
/** RCC_APB2LPENR_TIM10LPEN TIM10 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM10LPEN		(1 << 17)
/** RCC_APB2LPENR_TIM9LPEN TIM9 clock enable during sleep mode **/
#define RCC_APB2LPENR_TIM9LPEN		(1 << 16)
/** RCC_APB2LPENR_SYSCFGLPEN System configuration controller clock enable during Sleep mode **/
#define RCC_APB2LPENR_SYSCFGLPEN		(1 << 14)
/** RCC_APB2LPENR_SPI4LPEN SPI 4 clock enable during Sleep mode **/
#define RCC_APB2LPENR_SPI4LPEN		(1 << 13)
/** RCC_APB2LPENR_SPI1LPEN SPI 1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_SPI1LPEN		(1 << 12)
/** RCC_APB2LPENR_SDIOLPEN SDIO clock enable during Sleep mode **/
#define RCC_APB2LPENR_SDIOLPEN		(1 << 11)
/** RCC_APB2LPENR_ADC3LPEN ADC 3 clock enable during Sleep mode **/
#define RCC_APB2LPENR_ADC3LPEN		(1 << 10)
/** RCC_APB2LPENR_ADC2LPEN ADC2 clock enable during Sleep mode **/
#define RCC_APB2LPENR_ADC2LPEN		(1 << 9)
/** RCC_APB2LPENR_ADC1LPEN ADC1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_ADC1LPEN		(1 << 8)
/** RCC_APB2LPENR_USART6LPEN USART6 clock enable during Sleep mode **/
#define RCC_APB2LPENR_USART6LPEN		(1 << 5)
/** RCC_APB2LPENR_USART1LPEN USART1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_USART1LPEN		(1 << 4)
/** RCC_APB2LPENR_TIM8LPEN TIM8 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM8LPEN		(1 << 1)
/** RCC_APB2LPENR_TIM1LPEN TIM1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM1LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_bdcr BDCR Backup domain control register
@{*/

/** RCC_BDCR_BDRST Backup domain software reset **/
#define RCC_BDCR_BDRST		(1 << 16)
/** RCC_BDCR_RTCEN RTC clock enable **/
#define RCC_BDCR_RTCEN		(1 << 15)
/** RCC_BDCR_RTCSEL1 RTC clock source selection **/
#define RCC_BDCR_RTCSEL1		(1 << 9)
/** RCC_BDCR_RTCSEL0 RTC clock source selection **/
#define RCC_BDCR_RTCSEL0		(1 << 8)
/** RCC_BDCR_LSEMOD External low-speed oscillator mode **/
#define RCC_BDCR_LSEMOD		(1 << 3)
/** RCC_BDCR_LSEBYP External low-speed oscillator bypass **/
#define RCC_BDCR_LSEBYP		(1 << 2)
/** RCC_BDCR_LSERDY External low-speed oscillator ready **/
#define RCC_BDCR_LSERDY		(1 << 1)
/** RCC_BDCR_LSEON External low-speed oscillator enable **/
#define RCC_BDCR_LSEON		(1 << 0)

/**@}*/

/** @defgroup rcc_csr CSR clock control & status register
@{*/

/** RCC_CSR_LPWRRSTF Low-power reset flag **/
#define RCC_CSR_LPWRRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_WDGRSTF Independent watchdog reset flag **/
#define RCC_CSR_WDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_PORRSTF POR/PDR reset flag **/
#define RCC_CSR_PORRSTF		(1 << 27)
/** RCC_CSR_PADRSTF PIN reset flag **/
#define RCC_CSR_PADRSTF		(1 << 26)
/** RCC_CSR_BORRSTF BOR reset flag **/
#define RCC_CSR_BORRSTF		(1 << 25)
/** RCC_CSR_RMVF Remove reset flag **/
#define RCC_CSR_RMVF		(1 << 24)
/** RCC_CSR_LSIRDY Internal low-speed oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION Internal low-speed oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/

/** @defgroup rcc_sscgr SSCGR spread spectrum clock generation register
@{*/

/** RCC_SSCGR_SSCGEN Spread spectrum modulation enable **/
#define RCC_SSCGR_SSCGEN		(1 << 31)
/** RCC_SSCGR_SPREADSEL Spread Select **/
#define RCC_SSCGR_SPREADSEL		(1 << 30)

#define RCC_SSCGR_INCSTEP_SHIFT		13
#define RCC_SSCGR_INCSTEP_MASK		0x7fff
/** @defgroup rcc_sscgr_incstep INCSTEP Incrementation step
@{*/
/**@}*/


#define RCC_SSCGR_MODPER_SHIFT		0
#define RCC_SSCGR_MODPER_MASK		0x1fff
/** @defgroup rcc_sscgr_modper MODPER Modulation period
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_plli2scfgr PLLI2SCFGR PLLI2S configuration register
@{*/


#define RCC_PLLI2SCFGR_PLLI2SR_SHIFT		28
#define RCC_PLLI2SCFGR_PLLI2SR_MASK		0x07
/** @defgroup rcc_plli2scfgr_plli2sr PLLI2SR PLLI2S division factor for I2S clocks
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SQ_SHIFT		24
#define RCC_PLLI2SCFGR_PLLI2SQ_MASK		0x0f
/** @defgroup rcc_plli2scfgr_plli2sq PLLI2SQ PLLI2S division factor for SAI1 clock
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SN_SHIFT		6
#define RCC_PLLI2SCFGR_PLLI2SN_MASK		0x1ff
/** @defgroup rcc_plli2scfgr_plli2sn PLLI2SN PLLI2S multiplication factor for VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllsaicfgr PLLSAICFGR PLL configuration register
@{*/


#define RCC_PLLSAICFGR_PLLSAIR_SHIFT		28
#define RCC_PLLSAICFGR_PLLSAIR_MASK		0x07
/** @defgroup rcc_pllsaicfgr_pllsair PLLSAIR PLLSAI division factor for LCD clock
@{*/
/**@}*/


#define RCC_PLLSAICFGR_PLLSAIQ_SHIFT		24
#define RCC_PLLSAICFGR_PLLSAIQ_MASK		0x0f
/** @defgroup rcc_pllsaicfgr_pllsaiq PLLSAIQ PLLSAI division factor for SAI1 clock
@{*/
/**@}*/


#define RCC_PLLSAICFGR_PLLSAIP_SHIFT		16
#define RCC_PLLSAICFGR_PLLSAIP_MASK		0x03
/** @defgroup rcc_pllsaicfgr_pllsaip PLLSAIP PLLSAI division factor for 48 MHz clock
@{*/
/**@}*/


#define RCC_PLLSAICFGR_PLLSAIN_SHIFT		6
#define RCC_PLLSAICFGR_PLLSAIN_MASK		0x1ff
/** @defgroup rcc_pllsaicfgr_pllsain PLLSAIN PLLSAI division factor for VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_dckcfgr DCKCFGR Dedicated Clock Configuration Register
@{*/

/** RCC_DCKCFGR_DSISEL DSI clock source selection **/
#define RCC_DCKCFGR_DSISEL		(1 << 29)
/** RCC_DCKCFGR_SDMMCSEL SDIO clock source selection **/
#define RCC_DCKCFGR_SDMMCSEL		(1 << 28)
/** RCC_DCKCFGR_MSEL 48 MHz clock source selection **/
#define RCC_DCKCFGR_MSEL		(1 << 27)
/** RCC_DCKCFGR_TIMPRE Timers clocks prescalers selection **/
#define RCC_DCKCFGR_TIMPRE		(1 << 24)

#define RCC_DCKCFGR_SAI1BSRC_SHIFT		22
#define RCC_DCKCFGR_SAI1BSRC_MASK		0x03
/** @defgroup rcc_dckcfgr_sai1bsrc SAI1BSRC SAI1-B clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR_SAI1ASRC_SHIFT		20
#define RCC_DCKCFGR_SAI1ASRC_MASK		0x03
/** @defgroup rcc_dckcfgr_sai1asrc SAI1ASRC SAI1 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR_PLLSAIDIVR_SHIFT		16
#define RCC_DCKCFGR_PLLSAIDIVR_MASK		0x03
/** @defgroup rcc_dckcfgr_pllsaidivr PLLSAIDIVR PLLSAIDIVR
@{*/
/**@}*/


#define RCC_DCKCFGR_PLLSAIDIVQ_SHIFT		8
#define RCC_DCKCFGR_PLLSAIDIVQ_MASK		0x1f
/** @defgroup rcc_dckcfgr_pllsaidivq PLLSAIDIVQ PLLSAI division factor for SAIs clock
@{*/
/**@}*/


#define RCC_DCKCFGR_PLLIS2DIVQ_SHIFT		0
#define RCC_DCKCFGR_PLLIS2DIVQ_MASK		0x1f
/** @defgroup rcc_dckcfgr_pllis2divq PLLIS2DIVQ PLLI2S division factor for SAIs clock
@{*/
/**@}*/


/**@}*/
